Code/Analysis/data/GM1/system/funkySetBoundaryDict
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  4.0-ext                             
    \\  /    A nd           | Copyright held by original author
     \\/     M anipulation  |
-----------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      funkySetBoundaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

CWater1 {
    field CWater;
    expressions
    (
        {
            target value;
            patchName wall;
variables
(
    "cx=0;"
    "cy=0;"
    "cz=0;"
    "epsilon=1.7e-9;"   // R/0
    "height=160e-9;"     // 2*R
);
            expression "-tanh(-(pos().x - height)/(sqrt(2)*epsilon))";
            //expression "-tanh(-(pos().x -  (-1.91081305e+07 * pos().z*pos().z -3.00157291e-09 * pos().z + 1.54744479e-07) )/(sqrt(2)*epsilon))";
        }
    );
}


CAir1 {
    field CAir;
    expressions
    (
        {
            target value;
            patchName wall;
variables
(
    "cx=0;"
    "cy=0;"
    "cz=0;"
    "epsilon=1.7e-9;"   // R/0
    "height=160e-9;"     // 2*R
);
            expression "tanh(-(pos().x - height)/(sqrt(2)*epsilon))";
            //expression "tanh(-(pos().x -  (-1.91081305e+07 * pos().z*pos().z -3.00157291e-09 * pos().z + 1.54744479e-07) )/(sqrt(2)*epsilon))";
        }
    );
}
/*CAir1*/
/*{*/
/*    field CAir; */
/*    expressions */
/*    ( */
/*        { */
/*            target value; */
/*            patchName down;*/
/*            variables*/
/*            (*/
/*                "cx=5e-2;"*/
/*                "cy=0;"*/
/*                "cz=0;"*/
/*                "radius=5.0e-3;"*/
/*                "epsilon=2e-4;"*/
/*            );*/
/*            expression "-tanh((-sqrt(sqr(pos().x-cx)+sqr(pos().y-cy)+sqr(pos().z-cz))+radius)/(sqrt(2)*epsilon))";*/
/*        } */
/*    ); */
/*}*/

// ************************************************************************* //
